In [17]:
import pandas as pd
df = pd.read_csv('../data/train.csv')

In [3]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [8]:
df['Age'].count()

714

In [16]:
df[(20 < df['Age']) & (df['Age'] < 40)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN

In [18]:
df['Embarked'] = df['Embarked'].map({'C': 1, 'Q': 2, 'S': 3})
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,3.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,3.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,3.0

In [19]:
df['Sex'] = df['Sex'].map({'female': 0, 'male': 1})
df = df.rename(columns={'Sex': 'Male'})

In [21]:
df.head()

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,3.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,1.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,3.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,3.0

In [23]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Male             0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [26]:
df_dn = df.dropna()
df_dn.count()

PassengerId    183
Survived       183
Pclass         183
Name           183
Male           183
Age            183
SibSp          183
Parch          183
Ticket         183
Fare           183
Cabin          183
Embarked       183
dtype: int64

In [38]:
df[['Survived', 'Age']].head()

   Survived   Age
0         0  22.0
1         1  38.0
2         1  26.0
3         1  35.0
4         0  35.0

In [40]:
df_dn = df.drop('Cabin', axis='columns')
df_dn.head()

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,3.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,1.0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,3.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,3.0
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,3.0

In [54]:
import re

# 敬称を抽出する関数
def getTitle(row):
    name = row['Name']
    p = re.compile('.*\ (.*)\.\ .*')
    surname = p.search(name)
    return surname.group(1)

df['Title'] = df.apply(getTitle, axis='columns')
df.head()

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,AgeMean
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,3.0,Mr,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,1.0,Mrs,NaN
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3.0,Miss,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,3.0,Mrs,NaN
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,3.0,Mr,NaN

In [57]:
# 敬称ごとの平均年齢を求める
df.groupby('Title').mean()['Age']

Title
Capt        70.000000
Col         58.000000
Countess    33.000000
Don         40.000000
Dr          42.000000
Jonkheer    38.000000
L           54.000000
Lady        48.000000
Major       48.500000
Master       4.574167
Miss        21.773973
Mlle        24.000000
Mme         24.000000
Mr          32.368090
Mrs         35.728972
Ms          28.000000
Rev         43.166667
Sir         49.000000
Name: Age, dtype: float64

In [59]:
df.sort_values(by='Age')

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,AgeMean
803,804,1,3,"Thomas, Master. Assad Alexander",1,0.42,0,1,2625,8.5167,NaN,1.0,Master,NaN
755,756,1,2,"Hamalainen, Master. Viljo",1,0.67,1,1,250649,14.5000,NaN,3.0,Master,NaN
644,645,1,3,"Baclini, Miss. Eugenie",0,0.75,2,1,2666,19.2583,NaN,1.0,Miss,NaN
469,470,1,3,"Baclini, Miss. Helene Barbara",0,0.75,2,1,2666,19.2583,NaN,1.0,Miss,NaN
78,79,1,2,"Caldwell, Master. Alden Gates",1,0.83,0,2,248738,29.0000,NaN,3.0,Master,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",1,NaN,0,0,2629,7.2292,NaN,1.0,Mr,NaN
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",0,NaN,8,2,CA. 2343,69.5500,NaN,3.0,Miss,NaN
868,869,0,3,"van Melkebeke, Mr. Philemon",1,NaN,0,0,345777,9.5000,NaN,3.0,Mr,NaN
878,879,0,3,"Laleff, Mr. Kristo",1,NaN,0,0,349217,7.8958,NaN,3.0,Mr,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.4500,NaN,3.0,Miss,NaN

In [61]:
df['Survived'].unique()

array([0, 1], dtype=int64)

In [64]:
df[df['Name'].str.contains('Thomas')]

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,AgeMean
149,150,0,2,"Byles, Rev. Thomas Roussel Davids",1,42.00,0,0,244310,13.0000,NaN,3.0,Rev,NaN
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",0,22.00,1,0,113776,66.6000,C2,3.0,Mrs,NaN
159,160,0,3,"Sage, Master. Thomas Henry",1,NaN,8,2,CA. 2343,69.5500,NaN,3.0,Master,NaN
186,187,1,3,"O'Brien, Mrs. Thomas (Johanna ""Hannah"" Godfrey)",0,NaN,1,0,370365,15.5000,NaN,2.0,Mrs,NaN
252,253,0,1,"Stead, Mr. William Thomas",1,62.00,0,0,113514,26.5500,C87,3.0,Mr,NaN
260,261,0,3,"Smith, Mr. Thomas",1,NaN,0,0,384461,7.7500,NaN,2.0,Mr,NaN
336,337,0,1,"Pears, Mr. Thomas Clinton",1,29.00,1,0,113776,66.6000,C2,3.0,Mr,NaN
347,348,1,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",0,NaN,1,0,386525,16.1000,NaN,3.0,Mrs,NaN
364,365,0,3,"O'Brien, Mr. Thomas",1,NaN,1,0,370365,15.5000,NaN,2.0,Mr,NaN
372,373,0,3,"Beavan, Mr. William Thomas",1,19.00,0,0,323951,8.0500,NaN,3.0,Mr,NaN
415,416,0,3,"Meek, Mrs. Thomas (Annie Louise Rowley)",0,NaN,0,0,343095,8.0500,NaN,3.0,Mrs,NaN
560,561,0,3,"Morrow, Mr. Thomas Rowan",1,NaN,0,0,372622,7.7500,NaN,2.0,Mr,NaN
670,671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",0,40.00,1,1,29750,39.0000,NaN,3.0,Mrs,NaN
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",1,36.00,0,1,PC 17755,512.3292,B51 B53 B55,1.0,Mr,NaN
684,685,0,2,"Brown, Mr. Thomas William Solomon",1,60.00,1,1,29750,39.0000,NaN,3.0,Mr,NaN
758,759,0,3,"Theobald, Mr. Thomas Leonard",1,34.00,0,0,363294,8.0500,NaN,3.0,Mr,NaN
778,779,0,3,"Kilgannon, Mr. Thomas J",1,NaN,0,0,36865,7.7375,NaN,2.0,Mr,NaN
803,804,1,3,"Thomas, Master. Assad Alexander",1,0.42,0,1,2625,8.5167,NaN,1.0,Master,NaN
806,807,0,1,"Andrews, Mr. Thomas Jr",1,39.00,0,0,112050,0.0000,A36,3.0,Mr,NaN
828,829,1,3,"McCormack, Mr. Thomas Joseph",1,NaN,0,0,367228,7.7500,NaN,2.0,Mr,NaN
841,842,0,2,"Mudd, Mr. Thomas Charles",1,16.00,0,0,S.O./P.P. 3,10.5000,NaN,3.0,Mr,NaN
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",0,56.00,0,1,11767,83.1583,C50,1.0,Mrs,NaN

In [66]:
df[~df['Name'].str.contains('Thomas')]

,PassengerId,Survived,Pclass,Name,Male,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,AgeMean
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,7.2500,NaN,3.0,Mr,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,71.2833,C85,1.0,Mrs,NaN
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3.0,Miss,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,53.1000,C123,3.0,Mrs,NaN
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,8.0500,NaN,3.0,Mr,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,13.0000,NaN,3.0,Rev,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,30.0000,B42,3.0,Miss,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,NaN,1,2,W./C. 6607,23.4500,NaN,3.0,Miss,NaN
889,890,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,30.0000,C148,1.0,Mr,NaN
890,891,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,7.7500,NaN,2.0,Mr,NaN

In [71]:
# df.style.apply(lambda x: ['background-color: yellow' if v == 'Mr' else '' for v in x])